Revit 2027 API
ParameterTypeId.BasepointAngletonParam Property
 "Angle to True North"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BasepointAngletonParam { get; }
Public Shared ReadOnly Property BasepointAngletonParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BasepointAngletonParam {
	ForgeTypeId^ get ();
}
static member BasepointAngletonParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace